ilogicsBoss/Board/CustomBoard/Hardware/ILOGICS/avr/variants/8A4R-S/pins_arduino.h
// ============================================================================
// [PWM 타이머 매핑 테이블]
// ----------------------------------------------------------------------------
// analogWrite() 함수가 각 핀에 어떤 하드웨어 타이머를 사용할지 결정합니다.
//
// MPINO-8A4R-S 외부 PWM 출력 포트 :
//   - D21 (PE3) → Timer3 채널 A (OC3A)
//   - D22 (PE4) → Timer3 채널 B (OC3B)
//   - D23 (PE5) → Timer3 채널 C (OC3C)
//
// ※ 동일 Timer3 자원이 고속카운터(CLK 입력)에도 사용되므로,
//    두 기능을 동시에 사용하려면 사용설명서의 인터럽트 방식 고속카운터를
//    이용해 주시기 바랍니다.
// ============================================================================
const uint8_t PROGMEM digital_pin_to_timer_PGM[] = {
  NOT_ON_TIMER, // D0  → P0 (디지털 입력)
  NOT_ON_TIMER, // D1  → P1 (디지털 입력)
  NOT_ON_TIMER, // D2  → P2 (디지털 입력)
  NOT_ON_TIMER, // D3  → P3 (디지털 입력)
  NOT_ON_TIMER, // D4  → P4 (디지털 입력)
  NOT_ON_TIMER, // D5  → P5 (디지털 입력)
  NOT_ON_TIMER, // D6  → P6 (디지털 입력)
  NOT_ON_TIMER, // D7  → P7 (디지털 입력)
  NOT_ON_TIMER, // D8  → SS
  NOT_ON_TIMER, // D9  → SCK
  NOT_ON_TIMER, // D10 → MOSI
  NOT_ON_TIMER, // D11 → MISO
#if defined(__AVR_ATmega64__) || defined(__AVR_ATmega128__)
  TIMER0,       // D12 (PB4)
#elif defined(__AVR_ATmega1281__) || defined(__AVR_ATmega2561__) || defined(__AVR_AT90CAN32__) \
|| defined(__AVR_AT90CAN64__) || defined(__AVR_AT90CAN128__)
  TIMER2A,      // D12 (PB4)
#endif
  TIMER1A,      // D13 (PB5)
  TIMER1B,      // D14 (PB6)
  TIMER1C,      // D15 (PB7)
  NOT_ON_TIMER, // D16 → RX0
  NOT_ON_TIMER, // D17 → TX0
  NOT_ON_TIMER, // D18 → SCL / INT0
  NOT_ON_TIMER, // D19 → SDA / INT1
  NOT_ON_TIMER, // D20 → STATUS LED
  TIMER3A,      // D21 → PWM0 출력 (★ 외부 사용 가능)
  TIMER3B,      // D22 → PWM1 출력 (★ 외부 사용 가능)
  TIMER3C,      // D23 → PWM2 출력 (★ 외부 사용 가능)
  NOT_ON_TIMER, // D24 → CLK  / INT6
  NOT_ON_TIMER, // D25 → DIO  / INT7
  NOT_ON_TIMER, // D26
  NOT_ON_TIMER, // D27
  NOT_ON_TIMER, // D28 → RX1 / INT2
  NOT_ON_TIMER, // D29 → TX1 / INT3
  NOT_ON_TIMER, // D30
  NOT_ON_TIMER, // D31
  NOT_ON_TIMER, // D32 → 릴레이 P32
  NOT_ON_TIMER, // D33 → 릴레이 P33
  NOT_ON_TIMER, // D34 → 릴레이 P34
  NOT_ON_TIMER, // D35 → 릴레이 P35
  NOT_ON_TIMER, // D36
  NOT_ON_TIMER, // D37
  NOT_ON_TIMER, // D38
  NOT_ON_TIMER, // D39
  NOT_ON_TIMER, // D40
  NOT_ON_TIMER, // D41
  NOT_ON_TIMER, // D42
  NOT_ON_TIMER, // D43
  NOT_ON_TIMER, // D44
  NOT_ON_TIMER, // D45 → A0
  NOT_ON_TIMER, // D46 → A1
  NOT_ON_TIMER, // D47 → A2
  NOT_ON_TIMER, // D48 → A3
  NOT_ON_TIMER, // D49 → A4
  NOT_ON_TIMER, // D50 → A5
  NOT_ON_TIMER, // D51 → A6 (NTC)
  NOT_ON_TIMER, // D52 → A7 (NTC)
#if defined(__AVR_ATmega1281__) || defined(__AVR_ATmega2561__)
  TIMER0B,      // D53 (PG5)
#endif
};

#endif

// ============================================================================
// [시리얼 포트 매핑]
// ----------------------------------------------------------------------------
// MPINO-8A4R-S는 두 개의 하드웨어 UART 포트를 제공합니다.
//   - Serial   : USB 다운로드 포트 (D16=RX0, D17=TX0) — 디버깅용
//   - Serial1  : RS232 통신 포트 (D28=RX1, D29=TX1)
//                Modbus RTU Master/Slave 라이브러리 사용 가능
//
// 사용 예 :
//   Serial.begin(9600);       // 시리얼 모니터 (디버깅)
//   Serial1.begin(115200);    // RS232 통신
// ============================================================================
#define SERIAL_PORT_MONITOR         Serial
#define SERIAL_PORT_HARDWARE        Serial
#define SERIAL_PORT_HARDWARE_OPEN   Serial1
#define SERIAL_PORT_HARDWARE1       Serial1
#define SERIAL_PORT_HARDWARE_OPEN1  Serial1

#endif
